**Consider the following Python dictionary data and Python list labels:**

data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills'],
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4],
        'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

**1. Create a DataFrame birds from this dictionary data which has the index labels.**

In [22]:
import pandas as pd
import numpy as np
Data={'Birds':["Cranes","Cranes","plovers","spoonbills","spoonbills","Cranes","plovers","Cranes","spoonbills","spoonbills"],"Age":[3.5,4,1.5,np.nan,6,3,5.5,np.nan,8,4],"Visit":[2,4,3,4,3,4,2,2,3,2]
                 ,"Priority":["yes","yes","no","yes","no","no","no","yes","no","no"]}
label=["a","b","c","d","e","f","g","h","i","j"]

df=pd.DataFrame(Data,index=label)
df

        Birds  Age  Visit Priority
a      Cranes  3.5      2      yes
b      Cranes  4.0      4      yes
c     plovers  1.5      3       no
d  spoonbills  NaN      4      yes
e  spoonbills  6.0      3       no
f      Cranes  3.0      4       no
g     plovers  5.5      2       no
h      Cranes  NaN      2      yes
i  spoonbills  8.0      3       no
j  spoonbills  4.0      2       no

**2. Display a summary of the basic information about birds DataFrame and its data.**

In [3]:
df.describe()

            Age      Visit
count  8.000000  10.000000
mean   4.437500   2.900000
std    2.007797   0.875595
min    1.500000   2.000000
25%    3.375000   2.000000
50%    4.000000   3.000000
75%    5.625000   3.750000
max    8.000000   4.000000

**3. Print the first 2 rows of the birds dataframe **

In [7]:
df[:2]

    Birds  Age  Visit Priority
a  Cranes  3.5      2      yes
b  Cranes  4.0      4      yes

**4. Print all the rows with only 'birds' and 'age' columns from the dataframe**

In [11]:
df[["Birds","Age"]]

        Birds  Age
a      Cranes  3.5
b      Cranes  4.0
c     plovers  1.5
d  spoonbills  NaN
e   spoonbill  6.0
f      Cranes  3.0
g     plovers  5.5
h      cranes  NaN
i  spoonbills  8.0
j  spoonbills  4.0

**5. select [2, 3, 7] rows and in columns ['birds', 'age', 'visits']**

In [14]:
df.iloc[[2,3,7],[0,1,2]]

        Birds  Age  Visit
c     plovers  1.5      3
d  spoonbills  NaN      4
h      cranes  NaN      2

**6. select the rows where the number of visits is less than 4**

In [53]:
df[["Birds","Age","Visit","Priority"]] [(df["Visit"]<4)]

        Birds  Age  Visit Priority
a      Cranes  3.5      2      yes
c     plovers  1.5      3       no
e  spoonbills  6.0      3       no
g     plovers  5.5      2       no
h      Cranes  NaN      2      yes
i  spoonbills  8.0      3       no
j  spoonbills  4.0      2       no

**7. select the rows with columns ['birds', 'visits'] where the age is missing i.e NaN**

In [42]:
df[df.isna().any(axis=1)]

        Birds  Age  Visit Priority
d  spoonbills  NaN      4      yes
h      Cranes  NaN      2      yes

**8. Select the rows where the birds is a Cranes and the age is less than 4**

In [58]:
df[["Birds","Age","Visit","Priority"]] [(df["Birds"]=="Cranes") & (df["Age"]<4)]

    Birds  Age  Visit Priority
a  Cranes  3.5      2      yes
f  Cranes  3.0      4       no

**9. Select the rows the age is between 2 and 4(inclusive)**

In [61]:
df[["Birds","Age","Visit","Priority"]][(df["Age"]>2) &(df["Age"]<4)]

    Birds  Age  Visit Priority
a  Cranes  3.5      2      yes
f  Cranes  3.0      4       no

**10. Find the total number of visits of the bird Cranes**

In [118]:
g=df.groupby("Birds")
g["Visit"].sum()

Birds
Cranes        12
plovers        5
spoonbills    12
Name: Visit, dtype: int64

**11. Calculate the mean age for each different birds in dataframe.**

In [72]:
g=df.groupby("Birds")
print(g.mean())

            Age  Visit
Birds
Cranes      3.5    3.0
plovers     3.5    2.5
spoonbills  6.0    3.0

**12. Append a new row 'k' to dataframe with your choice of values for each column. Then delete that row to return the original DataFrame.**

In [99]:
Data={"Birds":["Kingfisher"],"Age":[3.6],"Visit":[4],"Priority":["yes"]}
label=["K"]
df1=pd.DataFrame(Data,index=label)
df.append(df1)
df.drop(df.index[-1])

        Birds  Age  Visit Priority
a      Cranes  3.5      2      yes
b      Cranes  4.0      4      yes
c     plovers  1.5      3       no
d  spoonbills  NaN      4      yes
e  spoonbills  6.0      3       no
f      Cranes  3.0      4       no
g     plovers  5.5      2       no
h      Cranes  NaN      2      yes
i  spoonbills  8.0      3       no

**13. Find the number of each type of birds in dataframe (Counts)**

In [122]:
g.size()

Birds
Cranes        4
plovers       2
spoonbills    4
dtype: int64

**14. Sort dataframe (birds) first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order.**

In [129]:
df.sort_values(by=["Age","Visit"],ascending=[False,True])

        Birds  Age  Visit Priority
i  spoonbills  8.0      3       no
e  spoonbills  6.0      3       no
g     plovers  5.5      2       no
j  spoonbills  4.0      2       no
b      Cranes  4.0      4      yes
a      Cranes  3.5      2      yes
f      Cranes  3.0      4       no
c     plovers  1.5      3       no
h      Cranes  NaN      2      yes
d  spoonbills  NaN      4      yes

**15. Replace the priority column values with'yes' should be 1 and 'no' should be 0**

In [138]:
df["Priority"]=df["Priority"].replace("yes",1) 
df["Priority"]= df["Priority"].replace("no",0)
df

        Birds  Age  Visit  Priority
a      Cranes  3.5      2         1
b      Cranes  4.0      4         1
c     plovers  1.5      3         0
d  spoonbills  NaN      4         1
e  spoonbills  6.0      3         0
f      Cranes  3.0      4         0
g     plovers  5.5      2         0
h      Cranes  NaN      2         1
i  spoonbills  8.0      3         0
j  spoonbills  4.0      2         0

**16. In the 'birds' column, change the 'Cranes' entries to 'trumpeters'.**

In [141]:
df["Birds"]=df["Birds"].replace("Cranes","trumpeters")
df

        Birds  Age  Visit  Priority
a  trumpeters  3.5      2         1
b  trumpeters  4.0      4         1
c     plovers  1.5      3         0
d  spoonbills  NaN      4         1
e  spoonbills  6.0      3         0
f  trumpeters  3.0      4         0
g     plovers  5.5      2         0
h  trumpeters  NaN      2         1
i  spoonbills  8.0      3         0
j  spoonbills  4.0      2         0